SteveLRojas/mcu_libs/CH559/CH559_MAX7219/CH559_MAX7219.h
#ifndef _CH559_MAX7219_H_
#define _CH559_MAX7219_H_

//HINT: Pin options. Use defines from GPIO library.
#define MAX7219_PORT_DIN	GPIO_PORT_0
#define MAX7219_PORT_CS		GPIO_PORT_0
#define MAX7219_PORT_CLK	GPIO_PORT_0
#define MAX7219_PIN_DIN		GPIO_PIN_5
#define MAX7219_PIN_CS		GPIO_PIN_6
#define MAX7219_PIN_CLK		GPIO_PIN_7

//HINT: Display options
#define MAX7219_NUM_DIGITS	8

#define MAX7219_CMD_NOP		0x0000
#define MAX7219_CMD_DIG0	0x0100
#define MAX7219_CMD_DIG1	0x0200
#define MAX7219_CMD_DIG2	0x0300
#define MAX7219_CMD_DIG3	0x0400
#define MAX7219_CMD_DIG4	0x0500
#define MAX7219_CMD_DIG5	0x0600
#define MAX7219_CMD_DIG6	0x0700
#define MAX7219_CMD_DIG7	0x0800
#define MAX7219_CMD_DECODE_MODE	0x0900
#define MAX7219_CMD_INTENSITY	0x0A00
#define MAX7219_CMD_SCAN_LIMIT	0x0B00
#define MAX7219_CMD_SHUTDOWN	0x0C00
#define MAX7219_CMD_DISP_TEST	0x0F00

#define MAX7219_DIG0_DECODE_EN	0x0001
#define MAX7219_DIG1_DECODE_EN	0x0002
#define MAX7219_DIG2_DECODE_EN	0x0004
#define MAX7219_DIG3_DECODE_EN	0x0008
#define MAX7219_DIG4_DECODE_EN	0x0010
#define MAX7219_DIG5_DECODE_EN	0x0020
#define MAX7219_DIG6_DECODE_EN	0x0040
#define MAX7219_DIG7_DECODE_EN	0x0080

#define MAX7219_INTENSITY_1_32	0x00
#define MAX7219_INTENSITY_3_32	0x01
#define MAX7219_INTENSITY_5_32	0x02
#define MAX7219_INTENSITY_7_32	0x03
#define MAX7219_INTENSITY_9_32	0x04
#define MAX7219_INTENSITY_11_32	0x05
#define MAX7219_INTENSITY_13_32	0x06
#define MAX7219_INTENSITY_15_32	0x07
#define MAX7219_INTENSITY_17_32	0x08
#define MAX7219_INTENSITY_19_32	0x09
#define MAX7219_INTENSITY_21_32	0x0A
#define MAX7219_INTENSITY_23_32	0x0B
#define MAX7219_INTENSITY_25_32	0x0C
#define MAX7219_INTENSITY_27_32	0x0D
#define MAX7219_INTENSITY_29_32	0x0E
#define MAX7219_INTENSITY_31_32	0x0F

#define MAX7219_SHUTDOWN_EN	0x0000
#define MAX7219_NORM_MODE	0x0001

#define MAX7219_TEST_DIS	0x0000
#define MAX7219_TEST_EN		0x0001

#define MAX7219_SEG_A	0x40
#define MAX7219_SEG_B	0x20
#define MAX7219_SEG_C	0x10
#define MAX7219_SEG_D	0x08
#define MAX7219_SEG_E	0x04
#define MAX7219_SEG_F	0x02
#define MAX7219_SEG_G	0x01
#define MAX7219_SEG_DP	0x80

extern UINT8 code max7219_hex_tab[16];
extern UINT8 max7219_buf[MAX7219_NUM_DIGITS];

#define max7219_set_digit(idx, val) (max7219_buf[idx] = max7219_hex_tab[val])
#define max7219_set_dp(idx, val) (max7219_buf[idx] = val ? (max7219_buf[idx] | MAX7219_SEG_DP) : (max7219_buf[idx] & ~ MAX7219_SEG_DP))
#define max7219_digit_off(idx) (max7219_buf[idx] = 0x00)

void max7219_init(UINT8 intensity);
void max7219_shift_out(UINT16 val);
void max7219_set_byte(UINT8 idx, UINT8 val);
void max7219_update(void);

#endif
